Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateOpeningCutOut Property
 Can't create Opening cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOpeningCutOut { get; }
Public Shared ReadOnly Property CannotCreateOpeningCutOut As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOpeningCutOut {
	FailureDefinitionId^ get ();
}
static member CannotCreateOpeningCutOut : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace